{
 "className": "io.deephaven.db.v2.utils.OrderedKeysKeyIndicesChunkImpl",
 "methods": {
  "asIndex": "Get an Index representation of this OrderedKeys.\n\n:return: (io.deephaven.db.v2.utils.Index) An Index representation for the same keys in the same order",
  "asKeyIndicesChunk": "Get a LongChunk representation of the individual keys in this OrderedKeys.\n\n:return: (io.deephaven.db.v2.sources.chunk.LongChunk<io.deephaven.db.v2.sources.chunk.Attributes.OrderedKeyIndices>) A LongChunk containing the keys in this OrderedKeys",
  "asKeyRangesChunk": "Get a LongChunk representation of key ranges in this OrderedKeys.\n\n:return: (io.deephaven.db.v2.sources.chunk.LongChunk<io.deephaven.db.v2.sources.chunk.Attributes.OrderedKeyRanges>) A LongChunk containing the key ranges in this OrderedKeys",
  "close": "Free any resources associated with this object.\n \n Using any OrderedKeys methods after close() is an error and may produce exceptions or undefined\n results.",
  "fillKeyIndicesChunk": "Fill the supplied WritableLongChunk with individual keys from this OrderedKeys.\n \n The chunk's capacity is assumed to be big enough.\n\n:param chunkToFill: (io.deephaven.db.v2.sources.chunk.WritableLongChunk<? extendsio.deephaven.db.v2.sources.chunk.Attributes.KeyIndices>) - A chunk to fill with individual keys",
  "fillKeyRangesChunk": "Fill the supplied WritableLongChunk with key ranges from this OrderedKeys.\n \n The chunk's capacity is assumed to be big enough.\n\n:param chunkToFill: (io.deephaven.db.v2.sources.chunk.WritableLongChunk<io.deephaven.db.v2.sources.chunk.Attributes.OrderedKeyRanges>) - A chunk to fill with key ranges",
  "firstKey": "Get the first key in this OrderedKeys.\n\n:return: (long) The first key, or ReadOnlyIndex.NULL_KEY if there is none.",
  "forEachLong": "For as long as the consumer wants more keys, call accept on the consumer with the individual key instances in\n this OrderedKeys, in increasing order.\n\n:param lc: (io.deephaven.db.v2.utils.LongAbortableConsumer) - a consumer to feed the individual key values to.\n:return: (boolean) false if the consumer provided ever returned false, true otherwise.",
  "forEachLongRange": "For as long as the consumer wants more ranges, call accept on the consumer with the individual key ranges in this\n OrderedKeys, in increasing order.\n\n:param lc: (io.deephaven.db.v2.utils.LongRangeAbortableConsumer) - a consumer to feed the individual key values to.\n:return: (boolean) false if the consumer provided ever returned false, true otherwise.",
  "getAverageRunLengthEstimate": "Get an estimate of the average (mean) length of runs of adjacent keys in this OrderedKeys.\n \n Implementations should strive to keep this method efficient (O(1) preferred) at the expense of accuracy.\n \n Empty OrderedKeys should return an arbitrary valid value, usually 1.\n\n:return: (long) An estimate of the average run length in this OrderedKeys, in [1, size()]",
  "getOrderedKeysByKeyRange": "Get an ordered subset of the keys in this OrderedKeys for a key range. The returned set will be the\n intersection of the keys in this with the keys in the closed interval [startKeyInclusive,\n endKeyInclusive].\n\n The returned reference is owned by the caller, who should call close() when it is done with it.\n\n:param startKeyInclusive: (long) - The minimum key to include\n:param endKeyInclusive: (long) - The maximum key to include\n:return: (io.deephaven.db.v2.utils.OrderedKeys) The subset as an OrderedKeys, which may be this",
  "getOrderedKeysByPosition": "Get an ordered subset of the keys in this OrderedKeys for a position range. The result will contain the\n set of keys in this that lie at positions in the half-open range [startPositionInclusive,\n startPositionInclusive + length).\n\n The returned reference is owned by the caller, who should call close() when it is done with it.\n\n:param startPositionInclusive: (long) - The position of the first key to include\n:param length: (long) - The number of keys to include\n:return: (io.deephaven.db.v2.utils.OrderedKeys) The subset as an OrderedKeys, which may be this",
  "getOrderedKeysIterator": "Get an OrderedKeys.Iterator over this OrderedKeys.\n\n:return: (io.deephaven.db.v2.utils.OrderedKeys.Iterator) A new iterator, positioned at the first key",
  "isEmpty": "True if the size of this Orderedkeys is zero.\n\n:return: (boolean) True if there are no elements in this OrderedKeys.",
  "lastKey": "Get the last key in this OrderedKeys.\n\n:return: (long) The last key, or ReadOnlyIndex.NULL_KEY if there is none.",
  "size": "Get the number of keys in this OrderedKeys.\n\n:return: (long) The size, in [0, Long.MAX_VALUE]"
 },
 "path": "io.deephaven.db.v2.utils.OrderedKeysKeyIndicesChunkImpl",
 "typeName": "class"
}