{
 "className": "io.deephaven.db.v2.utils.RedirectionIndexLockFreeImpl",
 "methods": {
  "fillFromChunk": "Our default, inefficient, implementation. Inheritors who care should provide a better implementation.\n\n:param context: io.deephaven.db.v2.sources.WritableChunkSink.FillFromContext\n:param src: io.deephaven.db.v2.sources.chunk.Chunk<? extendsio.deephaven.db.v2.sources.chunk.Attributes.Values>\n:param orderedKeys: io.deephaven.db.v2.utils.OrderedKeys",
  "get": "Gets the current value. Works correctly for Readers@Idle and Writer@Update. Readers@Update should be calling\n getPrev(); meanwhile Writer@Idle shouldn't be calling anything. The only Reader@Update who calls this should be\n one where the clock transitioned from Idle to Update while they were already running. Such a Reader should, upon\n eventually noticing that this transition happened, throw away their work and start again.\n\n:param key: long\n:return: long",
  "getPrev": "Gets the previous value. Works correctly for Readers@Update and Writer@Update. Readers@Idle should be calling\n get(); meanwhile Writer@Idle shouldn't be calling anything. The only Reader@Idle who calls this should be one who\n encountered a transition from Update to Idle while they were already running. Such a Reader should, upon\n eventually noticing that this transition happened, throw away their work and start again.\n\n:param key: long\n:return: long",
  "put": "Puts a value. Works correctly for Writer@Update. Readers should never call this; Writers@Idle shouldn't be\n calling anything.\n\n:param key: long\n:param value: long\n:return: long",
  "remove": "Removes a key. Works correctly for Writer@Update. Readers should never call this; Writers@Idle shouldn't be\n calling anything.\n\n:param key: long\n:return: long",
  "removeAll": ":param keys: io.deephaven.db.v2.utils.OrderedKeys"
 },
 "path": "io.deephaven.db.v2.utils.RedirectionIndexLockFreeImpl",
 "text": "This is a lock-free implementation of a RedirectionIndex. The rules for using this class are as follows.\n\n Users of this class fall into two roles:\n 1. Readers (snapshotters), of which there can be many.\n 2. Writers, of which there can be only one.\n\n Responsibilities of Readers:\n 1. Before you start, read the LogicalClock, note its value, and also note whether it is in the Idle or Update phase.\n 2. If you are in the \"Idle\" phase, then all your calls should be to get().\n 3. If you are in the \"Update\" phase, then all your calls should be to getPrev().\n 4. You must never call a mutating operation like put() or remove().\n 5. When you are done reading all the data you wanted, read the LogicalClock again. If it has the same value (both\n    generation and phase) as when you started, then you can rely on the data you have read. Otherwise, the data you\n    have is garbage, and you need to throw it all away and try again at step 1.\n\n Responsibilities of the Writer:\n 1. There must be only one Writer.\n 2. The Writer controls the LogicalClock. Put another way, unlike the Reader, the Writer does not have to worry about\n    a LogicalClock transition that would invalidate its work.\n 3. The Writer may call read operations (get() or getPrev()) at any time, i.e. regardless of phase (Idle or Update),\n    and they will always provide valid data.\n 4. The Writer must only call mutating operations (like put() or remove()) during an Update phase. The Writer MUST NOT\n    call these mutating operations during an Idle phase.\n 5. The Writer has no special responsibility when transitioning the LogicalClock from Idle to Update.\n 6. However, upon the transition from Update to Idle, the Writer does have an additional responsibility. Namely, the\n    writer must first transition the LogicalClock (from Update generation N to Idle generation N+1), then call our\n    method commitUpdates(). A logical place to do this might be the Terminal Listener.\n\n  Rationale that this code implements correct lock-free behavior:\n\n  Section I: The perspective of the Reader.\n\n  There are three cases:\n  1. When the LogicalClock has been in the Idle phase for the entirety of \"Reader Responsibilities\" steps 1-5 above.\n  2. When it has been in the Update phase for the entirety.\n  3. When it started in one phase and ended in the other.\n\n  We discuss these in reverse order.\n\n  For #3, our only responsibility is to not crash, corrupt memory, or go into an infinite loop. The get() / getPrev()\n  methods don't do any memory writes (so they can't corrupt memory). The argument that they can't crash or get into\n  an infinite loop can only be made by looking at the code. I won't try to justify it here, but hopefully we can\n  convince ourselves that this is so.\n\n  For #2, the Reader is only calling getPrev(), which only accesses 'baseline'. The Writer's last write to 'baseline'\n  happened before it set the logical clock to Update. LogicalClock being volatile means that these writes have been\n  'released'. Meanwhile, the Reader's first read to 'baseline' happens after it read the Update state from the\n  LogicalClock (and therefore has 'acquire' semantics).\n\n  #1 is the most complicated. For #1, the Reader is only calling get(), which accesses both 'baseline' and 'updates'.\n  Importantly, it consults 'updates' first, and only accesses 'baseline' for keys that are not in 'updates'.\n  The Writer's last write to 'updates' happened before it set the logical clock to Idle (thus these writes have been\n  released). Meanwhile, the Reader's first read from 'updates' happens after it read the Idle state from the\n  LogicalClock (and therefore has 'acquire' semantics). Calls to get(key) where key exists in the 'updates' map are\n  thus correct. We now concern ourselves with calls to get(key) where key does not exist in 'updates'.\n\n  The Writer spends the first part of the Idle cycle busily copying data from 'updates' back into 'baseline'. These\n  updates have these properties:\n  1. It does not disturb entries whose keys are are not in 'updates'.\n  2. When it writes to the buckets in 'baseline' it changes key slots from either 'deletedSlot' or 'emptySlot' to\n     some new key NEWKEY. We can argue that these writes do not affect the operation of the Reader, so it doesn't\n     matter whether the Reader sees them or not:\n     a) Importantly, the Reader is never looking for NEWKEY, because the Reader would have satisfied any search for\n        NEWKEY from the 'updates' map, which it consulted first.\n     b) If NEWKEY replaces a 'deletedSlot', then the Reader will skip over it as it does its probe. Because\n        NEWKEY != key, the Reader's logic is the same whether it seems NEWKEY or deletedSlot.\n     c) If NEWKEY replaces an 'emptySlot', then the Reader will probe further than it otherwise would have, but this\n        search will be ultimately futile, because it will eventually reach an emptySlot.\n  3. When it is finally done copying values over, the Writer will write null to the keysAndValues array inside\n     'updates' (this is a volatile write). Writer's last write to 'baseline' happened before it wrote that null. When\n     Reader consults 'updates' and finds a null there, it will also see all the writes made to 'baseline' (acquire\n     semantics).\n  4. Writer may need to do a rehash. If it does, it will prepare the hashed array off to the side and then write it\n     to 'baseline.keysAndValues' with a volatile write. When reader reads 'baseline.keysAndValues' (volatile read) it\n     will either see the old array or the fully-populated new one.\n\n Section II: The perspective of the Writer:\n\n From the Writer's own perspective, the data structure is always coherent, because the Writer is the only one writing\n to it. The only considerations are the Writer's responsibilities to the Reader. They are outlined in the above\n section \"Responsibilities of the Writer\". The one thing that needs to be explained further is what happens in\n commitUpdates().\n\n In commitUpdates() we iterate over the 'updates' hashtable and insert entries into the 'baseline' hashtable. If we\n need to rehash, we do so in a way that the Reader sees either the old buckets array or the new buckets array--we need\n to avoid the case where it sees some intermediate array which is only partially populated. To make this simple, we\n populate the new array off to the side and do a volatile write to store its reference. The Reader's next read of it\n is a volatile read, and it will pick it up then.\n\n When commitUpdates() is done, it writes a null to the 'updates.keysAndValues'. At this point all writes to the\n 'baseline' hashtable are finished as of the time of the write of the null. Next time the Reader reads this reference\n and finds it null, this will be an acquire and all the values in 'baseline' will be visible.\n\n That takes care of the transition from Update to Idle. Regarding the transition from Idle to Update, the caller does\n not have any special responsibility, but the first call to put() inside an Update generation causes a new\n 'keysAndValues' array to be generated, which the Reader will start to see next time it looks.",
 "typeName": "class"
}