{
 "className": "io.deephaven.engine.v2.sources.regioned.ParquetColumnRegionObject",
 "methods": {
  "getDictionaryKeysRegion": ":return: (io.deephaven.engine.v2.sources.regioned.ColumnRegionLong<io.deephaven.engine.chunk.Attributes.DictionaryKeys>) A dictionary keys region as specified by ColumnRegionObject.supportsDictionaryFormat(RowSet.SearchIterator)",
  "getDictionaryValuesRegion": ":return: (io.deephaven.engine.v2.sources.regioned.ColumnRegionObject<ParquetColumnRegionObject.DATA_TYPE,ParquetColumnRegionObject.ATTR>) A dictionary values region as specified by ColumnRegionObject.supportsDictionaryFormat(RowSet.SearchIterator)",
  "getObject": "Get a single object from this region.\n\n:param elementIndex: (long) - Element (object) rowSet in the table's address space\n:return: (ParquetColumnRegionObject.DATA_TYPE) The object value at the specified element (object) rowSet",
  "supportsDictionaryFormat": "Check if this region can expose an alternate form as paired regions of long keys and DATA_TYPE\n values covering all of its rowSet keys in keysToVisit.\n\n Both alternate regions must use the same or smaller rowSet key space as this one. Indices fetched from the\n keys region must represent valid element indices in the values region. Values regions must support\n ColumnRegionObject.gatherDictionaryValuesIndex(RowSet.SearchIterator, RowSequence.Iterator, RowSetBuilderSequential).\n\n Use ColumnRegionObject.getDictionaryKeysRegion() to access the region of keys and ColumnRegionObject.getDictionaryValuesRegion()\n to access the region of values.\n\n:param keysToVisit: (io.deephaven.engine.v2.utils.RowSet.SearchIterator) - Iterator positioned at the first relevant rowSet key belonging to this region.\n                    Will be advanced to after this region if true is returned.\n                    No guarantee is made if false is returned.\n:return: (io.deephaven.engine.v2.sources.regioned.RegionVisitResult) A RegionVisitResult specifying FAILED if this region cannot supply a dictionary,\n CONTINUE if it can and keysToVisit is not exhausted, and COMPLETE if it can and\n keysToVisit is exhausted"
 },
 "path": "io.deephaven.engine.v2.sources.regioned.ParquetColumnRegionObject",
 "text": "ColumnRegionObject implementation for regions that support fetching objects from\n column chunk page stores.",
 "typeName": "class"
}