{
 "className": "io.deephaven.engine.table.impl.sources.regioned.ColumnRegionObject$Constant",
 "methods": {
  "fillChunkAppend": "Appends the values repeating value length times to destination.\n\n:param context: io.deephaven.engine.table.ChunkSource.FillContext\n:param destination: io.deephaven.chunk.WritableChunk<? superColumnRegionObject.Constant.ATTR>\n:param length: int",
  "gatherDictionaryValuesRowSet": "Optional method that should only be used on regions returned by ColumnRegionObject.getDictionaryValuesRegion().\n Gathers\n\n:param keysToVisit: (io.deephaven.engine.rowset.RowSet.SearchIterator) - A search iterator over the enclosing table address space (which must have the same\n                          regions at the same masks), positioned at a row key in this region. Used to\n                          identify regions to visit. Should be advanced to after this region as a side-effect.\n:param knownKeys: (io.deephaven.engine.rowset.RowSequence.Iterator) - An iterator over the previously-known row keys, positioned at the first known key in\n                          this region, or after the region's maximum key if no keys are known. Should be advanced\n                          to after this region as a side effect.\n:param sequentialBuilder: (io.deephaven.engine.rowset.RowSetBuilderSequential) - Output builder; implementations should append ranges for row keys not found in\n                          knownKeys\n:return: (boolean) Whether keysToVisit has been exhausted",
  "getDictionaryKeysRegion": ":return: (io.deephaven.engine.table.impl.sources.regioned.ColumnRegionLong<io.deephaven.engine.table.impl.chunkattributes.DictionaryKeys>) A dictionary keys region as specified by ColumnRegionObject.supportsDictionaryFormat(RowSet.SearchIterator)",
  "getObject": "Get a single object from this region.\n\n:param elementIndex: (long) - Element row key in the table's address space\n:return: (ColumnRegionObject.Constant.DATA_TYPE) The object value at the specified element row key"
 },
 "path": "io.deephaven.engine.table.impl.sources.regioned.ColumnRegionObject.Constant",
 "typeName": "class"
}