{
 "className": "io.deephaven.db.v2.select.AbstractRangeFilter",
 "methods": {
  "filter": "Filter selection to only matching rows.\n\n:param selection: (io.deephaven.db.v2.utils.Index) - the indices that should be filtered. The selection must be a subset of fullSet; and may not\n        include rows that the engine determines need not be evaluated to produce the result.\n:param fullSet: (io.deephaven.db.v2.utils.Index) - the complete Index of the table to filter. The fullSet is used for calculating variables like \"i\"\n        or \"ii\".\n:param table: (io.deephaven.db.tables.Table) - the table to filter\n:param usePrev: (boolean) - true if previous values should be used. Implementing previous value filtering is optional, and a\n        SelectFilter.PreviousFilteringNotSupported exception may be thrown. If a PreviousFiltering exception is thrown,\n        then the caller must acquire the LiveTableMonitor lock.\n:return: (io.deephaven.db.v2.utils.Index) the subset of selection accepted by this filter",
  "getColumnArrays": "Get the array columns required by this select filter.\n\n:return: (java.util.List<java.lang.String>) the columns used as array input by this select filter.",
  "getColumns": "Get the columns required by this select filter.\n\n:return: (java.util.List<java.lang.String>) the columns used as input by this select filter.",
  "isSimpleFilter": ":return: (boolean) true if this is a filter that does not require any code execution, but rather is handled entirely within\n         the database engine.",
  "makeBigDecimalRange": ":param columnName: java.lang.String\n:param val: java.lang.String\n:return: io.deephaven.db.v2.select.SelectFilter",
  "setRecomputeListener": "Set the Listener that should be notified if results based on this filter must be recomputed.\n\n:param listener: (io.deephaven.db.v2.select.SelectFilter.RecomputeListener) - the listener to notify."
 },
 "path": "io.deephaven.db.v2.select.AbstractRangeFilter",
 "text": "A filter that determines if a column value is between an upper and lower bound (which each may either be inclusive or\n exclusive).",
 "typeName": "class"
}