{
 "className": "io.deephaven.db.v2.select.SelectFilter",
 "methods": {
  "canMemoize": "Can this filter operation be memoized?\n\n:return: (boolean) if this filter can be memoized",
  "copy": "Create a copy of this SelectFilter.\n\n:return: (io.deephaven.db.v2.select.SelectFilter) an independent copy of this SelectFilter.",
  "filter": "Filter selection to only matching rows.\n\n:param selection: (io.deephaven.db.v2.utils.Index) - the indices that should be filtered. The selection must be a subset of fullSet; and may not\n        include rows that the engine determines need not be evaluated to produce the result.\n:param fullSet: (io.deephaven.db.v2.utils.Index) - the complete Index of the table to filter. The fullSet is used for calculating variables like \"i\"\n        or \"ii\".\n:param table: (io.deephaven.db.tables.Table) - the table to filter\n:param usePrev: (boolean) - true if previous values should be used. Implementing previous value filtering is optional, and a\n        SelectFilter.PreviousFilteringNotSupported exception may be thrown. If a PreviousFiltering exception is thrown,\n        then the caller must acquire the LiveTableMonitor lock.\n:return: (io.deephaven.db.v2.utils.Index) the subset of selection accepted by this filter",
  "from": ":param filters: java.util.Collection<? extendsio.deephaven.api.filter.Filter>\n:return: io.deephaven.db.v2.select.SelectFilter[]",
  "fromInverted": ":param filters: java.util.Collection<? extendsio.deephaven.api.filter.Filter>\n:return: io.deephaven.db.v2.select.SelectFilter[]",
  "getColumnArrays": "Get the array columns required by this select filter.\n\n:return: (java.util.List<java.lang.String>) the columns used as array input by this select filter.",
  "getColumns": "Get the columns required by this select filter.\n\n:return: (java.util.List<java.lang.String>) the columns used as input by this select filter.",
  "init": "Initialize this select filter given the table definition\n\n:param tableDefinition: (io.deephaven.db.tables.TableDefinition) - the definition of the table that will be filtered",
  "isAutomatedFilter": "The database system may automatically generate a filter, for example, when applying an ACL to a table. There are\n certain operations which may bypass these filters.\n\n This function returns whether or not this filter is automated.\n\n:return: (boolean) true if this filter was automatically applied by the database system. False otherwise.",
  "isRefreshing": "Is this filter refreshing?\n\n:return: (boolean) if this filter is refreshing",
  "isSimpleFilter": ":return: (boolean) true if this is a filter that does not require any code execution, but rather is handled entirely within\n         the database engine.",
  "of": ":param filter: io.deephaven.api.filter.Filter\n:return: io.deephaven.db.v2.select.SelectFilter",
  "ofInverted": ":param filter: io.deephaven.api.filter.Filter\n:return: io.deephaven.db.v2.select.SelectFilter",
  "setAutomatedFilter": "The database system may automatically generate a filter, for example, when applying an ACL to a table. There are\n certain operations which may bypass these filters.\n\n This function indicates that this filter is automated.\n\n:param value: (boolean) - true if this filter was automatically applied by the database system. False otherwise.",
  "setRecomputeListener": "Set the Listener that should be notified if results based on this filter must be recomputed.\n\n:param result: (io.deephaven.db.v2.select.SelectFilter.RecomputeListener) - the listener to notify."
 },
 "path": "io.deephaven.db.v2.select.SelectFilter",
 "text": "Interface for individual filters within a where clause.",
 "typeName": "interface"
}