{
 "className": "io.deephaven.engine.updategraph.DynamicNode",
 "methods": {
  "addParentReference": "Called on a dependent node to ensure that a strong reference is maintained to any parent object that is required\n for the proper maintenance and functioning of the dependent.\n\n In the most common case, the parent object is a child listener to a parent node. The parent node only keeps a\n weak reference to its child listener, but the listener maintains a strong reference to the parent node. In this\n scenario, the only strong reference to the listener (and thus indirectly to the parent node itself) is the\n reference kept by the dependent node.\n\n:param parent: (java.lang.Object) - A parent of this node",
  "isDynamicAndIsRefreshing": "Determine if an object is a refreshing DynamicNode.\n\n:param object: (java.lang.Object) - The object\n:return: (boolean) True if the object is a DynamicNode and its isRefreshing() returns true,\n         false otherwise",
  "isDynamicAndNotRefreshing": "Determine if an object is a DynamicNode but is not refreshing.\n\n:param object: (java.lang.Object) - The object\n:return: (boolean) True if the object is a DynamicNode and its isRefreshing() returns true,\n         false otherwise",
  "isRefreshing": "Is the node updating?\n\n:return: (boolean) true if the node is updating; false otherwise.",
  "notDynamicOrIsRefreshing": "Determine if an object is either not a DynamicNode, or is a refreshing DynamicNode.\n\n:param object: (java.lang.Object) - The object\n:return: (boolean) True if the object is not a DynamicNode or if its isRefreshing() returns\n         true, false otherwise",
  "notDynamicOrNotRefreshing": "Determine if an object is not a refreshing DynamicNode.\n\n:param object: (java.lang.Object) - The object\n:return: (boolean) True if the object is not a DynamicNode or its isRefreshing() returns false,\n         false otherwise",
  "setRefreshing": "Change the node's run mode.\n\n:param refreshing: (boolean) - true to cause the node to update; false otherwise.\n:return: (boolean) new refreshing state"
 },
 "path": "io.deephaven.engine.updategraph.DynamicNode",
 "text": "Interface for dynamic nodes in a query's directed acyclic graph.",
 "typeName": "interface"
}