{
 "className": "io.deephaven.engine.util.NoLanguageDeephavenSession",
 "methods": {
  "clearScriptPathLoader": "Removes the currently configured script path loader from this script.",
  "getVariable": "**Incompatible overloads text - text from the first overload:**\n\nRetrieve a variable from the script session's bindings.\n \n Please use ScriptSession.getVariable(String, Object) if you expect the variable may not exist.\n\n*Overload 1*  \n  :param name: (java.lang.String) - the variable to retrieve\n  :return: (java.lang.Object) the variable\n  \n*Overload 2*  \n  Note: Java generics information - <T>\n  \n  :param name: (java.lang.String) - the variable to retrieve\n  :param defaultValue: (T) - the value to use when no value is present in the session's scope\n  :return: (T) the value of the variable, or defaultValue if not present",
  "getVariableNames": "Retrieves all of the variable names present in the session's scope\n\n:return: (java.util.Set<java.lang.String>) an unmodifiable set of variable names",
  "getVariables": "Retrieves all of the variables present in the session's scope (e.g., Groovy binding, Python globals()).\n\n:return: (java.util.Map<java.lang.String,java.lang.Object>) an unmodifiable map with variable names as the keys, and the Objects as the result",
  "hasVariableName": "Check if the scope has the given variable name\n\n:param name: (java.lang.String) - the variable name\n:return: (boolean) True iff the scope has the given variable name",
  "newQueryScope": ":return: (io.deephaven.engine.table.lang.QueryScope) a query scope for this session; only invoked during construction",
  "onApplicationInitializationBegin": "Called before Application initialization, should setup sourcing from the controller (as required).\n\n:param pathLoader: java.util.function.Supplier<io.deephaven.engine.util.scripts.ScriptPathLoader>\n:param scriptLoaderState: io.deephaven.engine.util.scripts.ScriptPathLoaderState",
  "onApplicationInitializationEnd": "Called after Application initialization.",
  "scriptType": ":return: (java.lang.String) a textual description of this script session's language for use in messages.",
  "setScriptPathLoader": "Sets the scriptPathLoader that is in use for this session.\n\n:param scriptPathLoader: (java.util.function.Supplier<io.deephaven.engine.util.scripts.ScriptPathLoader>) - a supplier of a script path loader\n:param caching: (boolean) - whether the source operation should cache results",
  "setUseOriginalScriptLoaderState": "Informs the session whether or not we should be using the original ScriptLoaderState for source commands.\n\n:param useOriginal: (boolean) - whether to use the script loader state at persistent query initialization\n:return: boolean",
  "setVariable": "Inserts a value into the script's scope.\n\n:param name: (java.lang.String) - the variable name to set\n:param newValue: (java.lang.Object) - the new value of the variable"
 },
 "path": "io.deephaven.engine.util.NoLanguageDeephavenSession",
 "text": "ScriptSession implementation that simply allows variables to be exported. This is not intended for use in user\n scripts.",
 "typeName": "class"
}