{
 "className": "io.deephaven.engine.util.TickSuppressor",
 "methods": {
  "convertModificationsToAddsAndRemoves": "For shift aware listeners, the modified column set cannot mark particular rows and columns dirty; only all of the\n columns in the modified rows. However, rows can be both removed and added and those rows do not affect the\n modified column set.\n\n \n If you have a table that has a small number of modified rows with many modified columns; and join on a right-hand\n side that modifies many rows, but few columns; downstream operations must treat all rows and columns in the cross\n product as modified.\n \n\n This utility function will convert all modified rows to added and removed rows, such that downstream operations\n can modify rows without additionally marking the columns of this table dirty.\n \n\n:param input: (io.deephaven.engine.table.Table) - an input table\n:return: (io.deephaven.engine.table.Table) an output table that will produce no modified rows, but rather adds and removes instead",
  "removeSpuriousModifications": "Removes spurious modifications from an update.\n\n \n The Deephaven query engine guarantees that any row or column that has been modified, must be marked modified in\n an update. However, for efficiency, it does not guarantee that only rows with changed data are marked as\n modified. There are cases where a query writer would like to remove spurious modifications. For example if a\n downstream listener is sending network messages eliminating additional messages may be worthwhile.\n \n\n This function produces a new query table with the same contents as the original query table. For each modified\n row and column, if a row has not actually been modified or a column has no modifications; then remove the\n modification from the downstream update.\n \n\n:param input: (io.deephaven.engine.table.Table) - an input table\n:return: (io.deephaven.engine.table.Table) an output table where the set of modified rows and columns is restricted to cells where current and\n         previous values are not identical"
 },
 "path": "io.deephaven.engine.util.TickSuppressor",
 "text": "Tools for reducing the number of ticks generated by a table.",
 "typeName": "class"
}