{
 "className": "io.deephaven.db.v2.utils.sortedranges.SortedRanges$RangeIterator",
 "methods": {
  "advance": "Advance the current iterator position until currentRangeStart() and currentRangeEnd()\n are both greater than or equal to  v . This may or may not move the iterator to the next range:\n if  v  is inside the current range (but to the right of currentRangeStart(),\n this will simply advance currentRangeStart(). Returns true if the operation was successful.\n Otherwise, returns false. In this case the iteration is over and the iterator\n is exhausted (calls to hasNext() will return false, any other operation is undefined).\n\n\n Although calls to advance() may be interleaved with calls to hasNext()/next() if necessary,\n this is not the common case, as they are separate protocols having little to do with each other.\n In particular, when iterating with advance(), you do not use next() to bring the next range into view,\n even at the start of the iteration. Many common usages only involve calls to advance().\n \n\n Example:\n \n\n RangeIterator it = index.getRangeIterator();\n if (!it.advance(100)) {\n     return;  // iteration done  no ranges at 100 or greater\n }\n assert(it.currentRangeStart() >= 100 && it.currentRangeEnd() >= 100);\n  // do something with range\n if (!it.advance(500)) {\n    return;  // iteration done  no ranges at 500 or greater\n }\n assert(it.currentRangeStart() >= 500 && it.currentRangeEnd() >= 500);\n // do something with range\n \n\n:param v: (long) - a value to search forward from the current iterator position\n:return: (boolean) false if iteration is exhausted, otherwise true.",
  "advanceImpl": ":param v: long\n:return: boolean",
  "currentRangeEnd": ":return: long",
  "currentRangeStart": ":return: long",
  "hasNext": ":return: boolean",
  "next": ":return: long",
  "postpone": "Given an iterator state with a current range of [start, end],\n and a value v such that start <= v <= end, postpone(v)\n makes the iterator current range [v, end].\n This call is useful to code that may need to process parts of ranges\n from different call sites from the site iterator.\n The results of this call are undefined if the value provided is not\n contained in the current range.\n\n:param v: (long) - A value contained in the current iterator range"
 },
 "path": "io.deephaven.db.v2.utils.sortedranges.SortedRanges.RangeIterator",
 "typeName": "class"
}