{
 "className": "io.deephaven.base.string.cache.StringCompatible",
 "methods": {
  "compareTo": "Implementations MUST compare StringCompatibles and Strings char-by-char.\n\n:param that: java.lang.CharSequence\n:return: (int) 0, <0, or >0 if that compares equal-to, less-than, or greater-than this.",
  "equals": ":param that: java.lang.Object\n:return: (boolean) true iff that is a StringCompatible of the same class with identical members.",
  "hash": "Compute a hash code for a CharSequence using the algorithm employed by String.hashCode().\n\n:param cs: (java.lang.CharSequence) - The CharSequence to hash\n:return: (int) The hash code",
  "hashCode": "Implementations MUST match the current implementation of String.hashCode().\n\n:return: (int) A hashcode value for this StringCompatible that matches the value a String of the same chars.",
  "toCompressedString": "Convert this StringCompatible into a CompressedString. Implementations should not cache result CompressedStrings,\n in order to avoid inadvertently allowing promotion of short-lived objects under generational garbage collection.\n\n:return: (io.deephaven.base.string.cache.CompressedString) A newly constructed CompressedString representing the same sequence of characters as this\n         StringCompatible (or this object, if appropriate).",
  "toMappedCompressedString": "Convert this StringCompatible into a MappedCompressedString. Implementations should not cache result\n CompressedStrings, in order to avoid inadvertently allowing promotion of short-lived objects under generational\n garbage collection.\n\n:return: (io.deephaven.base.string.cache.MappedCompressedString) A newly constructed MappedCompressedString representing the same sequence of characters as this\n         StringCompatible (or this object, if appropriate).",
  "toString": "Convert this StringCompatible into a String. Implementations should not cache result Strings, in order to avoid\n inadvertently allowing promotion of short-lived objects under generational garbage collection.\n\n:return: (java.lang.String) A newly constructed String representing the same sequence of characters as this StringCompatible."
 },
 "path": "io.deephaven.base.string.cache.StringCompatible",
 "text": "Marker interface for CharSequences to be used in StringCache implementations.",
 "typeName": "interface"
}